export const questions = [
    // E(+) vs I(-)
    { id: 1, type: "EI", text: "새로운 프로젝트가 시작되는 날, 나는 동료 개발자들과 브레인스토밍하며 아이디어를 낸다." },
    { id: 2, type: "EI", text: "개발 관련 커뮤니티 활동이나 네트워킹이 즐겁다." },
    { id: 3, type: "EI", text: "문제가 풀리지 않을 때 혼자 고민하기보다 동료에게 질문하며 소통하는 편이다." },
    // N(+) vs S(-)
    { id: 4, type: "NS", text: "기술의 설계 철학이나 추상적인 원리를 먼저 파악하는 것을 선호한다." },
    { id: 5, type: "NS", text: "큰 흐름만 이해하면 디테일은 자연스럽게 따라온다고 생각한다." },
    { id: 6, type: "NS", text: "이미 검증된 구체적인 개발 방법론을 따르는 것보다, 혁신적이고 실험적인 새로운 설계 방식을 상상하는 것도 선호한다." },
    // F(+) vs T(-)
    { id: 7, type: "FT", text: "코드 리뷰를 할 때 정확한 지적보다는 상대방의 기분을 고려하는 것이 더 중요하다." },
    { id: 8, type: "FT", text: "팀 분위기와 팀원들의 감정 상태도 프로젝트 성공에 중요하다고 생각한다. " },
    { id: 9, type: "FT", text: "팀 내에서 의견 충돌이나 문제가 발생했을 때, 논리적인 시시비비를 가려 결론을 내는 것보다 팀원 모두가 수긍하고 상처받지 않는 분위기를 만드는 것이 더 중요하다." },
    // P(+) vs J(-)
    { id: 10, type: "PJ", text: "기획이 완벽하지 않아도 일단 만들어보면서 수정하는 편이다." },
    { id: 11, type: "PJ", text: "마감 직전의 몰입감이 오히려 생산성을 폭발시킨다고 느낀다." },
    { id: 12, type: "PJ", text: "효율적인 새 도구가 발견되면 기존 계획을 변경해서라도 즉흥적으로 시도한다." },
];